HW4/solution/app/controllers/movies_controller.rb

  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'bg-warning hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'bg-warning hilite'
    end
    @all_ratings = Movie.select(:rating).map(&:rating).uniq
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG')

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "release_date" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "007 - 2021"], ["rating", "R"], ["release_date", "2021-10-14 00:00:00.000000"], ["director", "Me2"], ["updated_at", "2021-10-14 21:31:05.579847"], ["id", 1]]

  def same_director
    @movie = Movie.find(params[:id])
    director = @movie.director
    if director.blank?
      flash[:notice] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      @movies = Movie.where(director: director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]